PeoplesC/app/controllers/pictures_controller.rb

INSERT INTO `pictures` (`created_at`, `image`, `updated_at`) VALUES ('2013-10-22 20:41:40', NULL, '2013-10-22 20:41:40')
---
  def new
    @picture = Picture.new
    @picture.image = params[:file]
	@picture.admin = Admin.find 1 #TODO hardcoded for now
	@picture.project = Project.find 1; #TODO needs to be  actively assigned later, hardcoding for testing
    @picture.save!

INSERT INTO `pictures` (`created_at`, `image`, `updated_at`) VALUES ('2013-10-22 20:27:45', NULL, '2013-10-22 20:27:45')
---
  def create
    @picture = Picture.new(picture_params)

    respond_to do |format|
      if @picture.save

SELECT `pictures`.* FROM `pictures` WHERE `pictures`.`id` = 1 LIMIT 1
---
  def set_picture
    @picture = Picture.find(params[:id])